
## Plan Result (ecs_practice/terraform)

[CI link](https://github.com/harayu-k/infra_sandbox/actions/runs/12748628862)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_policy_attachment.ecs_codedeploy
  * aws_iam_role.ecs_codedeploy


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_policy_attachment.ecs_codedeploy will be created
  + resource "aws_iam_policy_attachment" "ecs_codedeploy" {
      + id         = (known after apply)
      + name       = "ECSCodeDeploy"
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS"
      + roles      = [
          + "ECSCodeDeploy",
        ]
    }

  # aws_iam_role.ecs_codedeploy will be created
  + resource "aws_iam_role" "ecs_codedeploy" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ECSCodeDeploy"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Managed" = "Terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":26,"Program":"tfcmt","SHA1":"da7fb17c1ea6d0c08e2902efcee74f6bb0f19f8f","Target":"ecs_practice/terraform","Vars":{},"WorkflowName":"terraform-plan"} -->